<?php

$countries = ['Безумие', 'Боевик', 'Боевые искусства', 'Вампиры', 'Военное', 'Гарем', 'Гендерная интрига',
    'Героическое фэнтези', 'Демоны', 'Детектив', 'Дзёсей', 'Додзинси', 'Драма', 'Дружба', 'Игры', 'Исекай',
    'Исторический', 'История', 'Комедия', 'Медицина', 'Меха', 'Мистика', 'Музыка', 'Научная фантастика',
    'Омегаверс', 'Пародия', 'Повседневность', 'Полиция', 'Постапокалиптика', 'Приключения', 'Психология',
    'Романтика', 'Самурайский боевик', 'Сверхъестественное', 'Сёдзё', 'Сёнэн', 'Смена пола', 'Спорт',
    'Супер сила', 'Сэйнэн', 'Трагедия', 'Триллер', 'Ужасы', 'Фантастика', 'Фэнтези', 'Школа', 'Эротика', 'Этти'];

$arr['title'] = $countries;
$arr['description'] = ['Жанр безумие характеризуется либо алогичностью происходящего в сюжетной компоненте, либо кажущейся бессмысленностью в визуальном плане. В первом случае произведения нацелены на обратный эффект: казалось бы безумное действо имеет целью заставить зрителя задуматься, взглянуть с другого ракурса на привычное и устоявшееся. Этот художественный приём может применяться и для привнесения юмористического оттенка в произведение. Во втором случае не несущему сюжетной нагрузки визуальному ряду обычно сопутствует соответствующее сопровождение для погружения читателя в состояние, которого добивается автор: тревожное, умиротворённое, созерцательное и пр.',
    'Боевик — обилие боевых сцен, перестрелок и погонь. Часто в этом жанре выполнены Сёнэн и Сёйнэн манги.',
    'Жанр манги, сюжет которой связан с противостоянием мастеров различных боевых искусств.',
    'Истории о вампирах, их жертвах и охотников на вампиров.',
    'Манга на военную тематику– особый жанр манги, отличающийся тематикой войны. Именно такие истории отличаются наличием реконструирующих исторические события картин. Различные виды оружия, сцены сражений и панорамные развороты полностью отражают специфику данного жанра.',
    'Жанр отношений в аниме и манге, в котором главный персонаж оказывается окружён большим количеством персонажей другого пола.',
    'Жанр, в котором уделяется внимание девушке или парню, скрывающим свою половую принадлежность. Девушка выдает себя за парня или наоборот.',
    'Жанр манги, описывающие приключения героев в фэнтезийном антураже.',
    'Изначально жанр демонов поднялся в свои ряды из-за растущей славы персонажей демонов, но жанр также распространяется и на другие сущности, такие как монстры, звери, призраки и другие демоны. Верьте или нет, эта категория не просто идет рука об руку с жанром ужасов; он удивительно хорошо сочетается и с другими жанрами (что подтверждается огромным и постоянно растущим количеством манги в жанре демонов).',
    'Детектив — о расследовании преступлений. Часто применяется нуарный стиль рисовки для создания загадочно-зловещей атмосферы.',
    'Дзёсэй — аниме или манга для женщин. Сюжет чаще всего описывает повседневную жизнь женщины, живущей в Японии. Как правило, часть повествования отводится под события из школьной жизни главной героини (именно в это время она знакомится с другими действующими лицами и происходит завязка сюжета). Стиль рисунка, используемый в дзёсэе, немного более реалистичен, чем в сёдзё, однако сохраняет в себе некоторые его характерные особенности. Опять-таки, в отличие от сёдзё, любовные отношения изображены в дзёсэе намного более проработаны.',
    'Додзинси - это любительская манга, которую рисуют по понравившимся манге, аниме, играм, книгам, фильмам (да по чему угодно) . Некий аналог фанфикшена.',
    'Драма — основной акцент сделан на чувствах и переживаниях героев, личной трагедии персонажа.',
    'Произведения содержат множество юмористических сцен, основываются на темах крепкой дружбы, любого вида соперничества в жизни, спорте или в боевых искусствах.',
    'Истории, в которых главные герои играют в игры. Это могут быть как и психологические игры, так и онлайн миры и обычные настольные игры.',
    'Японский жанр портального фэнтези. Он включает в себя романы, легкие романы, фильмы, мангу, аниме и видеоигры, которые вращаются вокруг человека или людей, которые перенесены в другой мир и должны выжить в другом мире, таком как мир фантазий, виртуальный мир, другая планета или параллельная вселенная.',
    'Жанр произведений, характеризующийся тем, что их действия разворачиваются на фоне реальных исторических событий. Популярным сеттингом являются Западная Европа и Британия, но большинство таких произведений разворачивается в Японии.',
    'Жанр произведений, характеризующийся тем, что их действия разворачиваются на фоне реальных исторических событий. Популярным сеттингом являются Западная Европа и Британия, но большинство таких произведений разворачивается в Японии.',
    'Комедия — обилие юмористических сцен, гротескная и яркая рисовка. Не несёт особой смысловой нагрузки и служит для развлечения читателя.',
    'Истории про врачей и больных.',
    'Жанр, характеризующийся активным использованием «гигантских боевых человекоподобных роботов», как правило, самодвижущихся, не имеющих реальных прототипов, обозначаемых этим же словом.',
    'Жанр манги, рассказывающий о сверхъестественных силах и потустороннем мире.',
    'В историях этого жанра музыка занимает не последнее место. Музыканты, танцоры, учителя музыки и, конечно, сама музыка.',
    'Произведения, действие которых связано с существованием и использованием техники, не существовавшей на момент создания этого аниме (межзвёздных космических кораблей, бластеров и т. д.) Обычно произведения в этом жанре излагают возможную историю будущего человечества, часто сюжеты связаны с контактами с пришельцами.',
    'Омегаверс - термин, использующийся в произведениях, вселенная которых предполагает деление каждого пола на три категории "альфа", "бета" и "омега". Вопреки логике, альфы являются осеменителями, а омеги выполняют функции вынашивания и рождения детей независимо от пола персонажей. Потому произведения омегаверса чаще всего останавливаются на однополости, а, в силу физиологических причин, большинство произведений омегаверса относятся к виду "слеш".',
    'Пародия — это «произведение-насмешка» по мотивам уже существующего известного произведения.',
    'Манга, повествующая о жизни простых обывателей.',
    'Жанр, описывающий действия полиции по вычислению и ловле преступника.',
    'Разновидность манги, повествующей о жизни после глобальной катастрофы — Конце Света.',
    'Приключение — захватывающее происшествие, неожиданное событие или случай в жизни, цепь нечаянных событий и непредвиденных случаев; нежданная быль, замечательное свершение, волнующее похождение, интересное испытание, возбуждающий переворот или любовная авантюра.',
    'Психологический триллер — жанр манги, описывающий злоключения человеческой души. Попадая в тяжелые ситуации, герои таких аниме переживают сложные и непредсказуемые психологические изменения.',
    'Жанр манги, повествующий о любовных переживаниях.',
    'Историко-приключенческий жанр произведений о сражениях самураев и ниндзя.',
    'Жанр манги, рассказывающий о сверхъестественных силах и потустороннем мире.',
    'Сёдзё (яп. 少女) — для девушек от 12 до 18 лет. Манга этого жанра повествует о молодой девушке, её жизни, проблемах, переживаниях и любви.',
    'Сёнен (сё:нэн манга 少年) — для юношей от 12 до 18 лет. Динамичный сюжет, обилие юмористических и боевых сцен. Основные темы: мужская дружба, соперничество в жизни, спорте, боевых искусствах. Главные герои — пример достойного поведения для подростков: они целеустремлённы, упорны, позитивны и выходят победителями из любых неприятных и опасных ситуаций. Основные признаки жанра: быстрое развитие и ярко выраженный динамизм сюжета. Произведения содержат множество юмористических сцен, основываются на темах крепкой мужской дружбы, любого вида соперничества в жизни, спорте или в боевых искусствах. Девушки и женщины в сёнэн аниме часто изображаются преувеличенно красивыми и сексуальными, такое гипертрофирование служит для наилучшего проявления мужественности главных героев. Как вариант, множество красивых девушек стараются привлечь внимание одного героя.',
    'Герои во время истории или до её начала изменили свой пол.',
    'Жанр, повествующий о юных спортсменах, добивающихся успеха благодаря своей воле к победе.',
    'Герои истории обладают той или иной суперсилой.',
    'Сэйнэн — аниме или манга для взрослых мужчин (от 18 до 25-40 лет). Характерными чертами этого жанра являются элементы психологии, сатиры, эротики, больше внимания уделяется развитию персонажей.[5] Сэйнэн иногда путают с сёдзё, однако произведения в этом жанре реалистичнее и мрачнее (Maison Ikkoku, Ghost in the Shell), а сюжет не завязан на романтической истории, хотя любовная история может присутствовать (Monster, Berserk). В редких случаях аниме или манга в жанре сэйнэн нацелены на бизнесменов в возрасте более 35-40 лет.',
    'Трагедия – драматическая манга, изображающее глубокие, чаще всего неразрешимые жизненные противоречия. Их последствия завершаются гибелью героя',
    'Жанр манги, описывающий «злоключения человеческой души». Попадая в тяжелые ситуации, герои таких аниме переживают сложные и непредсказуемые психологические изменения.',
    'Жанр манги, который предназначен устрашить, напугать, шокировать или вызвать отвращение у своих читателей, вызвав у них чувства ужаса и шока.',
    'Произведения, действие которых связано с существованием и использованием техники, не существовавшей на момент создания этого аниме (межзвёздных космических кораблей, бластеров и т. д.) Обычно произведения в этом жанре излагают возможную историю будущего человечества, часто сюжеты связаны с контактами с пришельцами.',
    'Манга, рассказывающая о мирах, которыми правит не технология (как в НФ), а «меч и магия». В фэнтези часто фигурируют не только люди, но и разнообразные мифологические существа — эльфы, гномы, драконы, оборотни, люди-кошки, а также боги и демоны.',
    'Жанр произведений, в котором в роли главных героев выступают персонажи-школьники.',
    'Порнографическая или эротическая манга соответственно. Произведения также могут находиться на стыке между хентаем и другими жанрами и иметь достаточно проработанный сюжет.',
    'Этти — об отношениях полов. Сексуальные отношения не изображаются напрямую — присутствует лишь лёгкая эротика.'];

function translit($value): string
{
    $converter = array(
        'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd',
        'е' => 'e', 'ё' => 'e', 'ж' => 'zh', 'з' => 'z', 'и' => 'i',
        'й' => 'y', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n',
        'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't',
        'у' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'c', 'ч' => 'ch',
        'ш' => 'sh', 'щ' => 'sch', 'ь' => '', 'ы' => 'y', 'ъ' => '',
        'э' => 'e', 'ю' => 'yu', 'я' => 'ya',

        'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G', 'Д' => 'D',
        'Е' => 'E', 'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z', 'И' => 'I',
        'Й' => 'Y', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N',
        'О' => 'O', 'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T',
        'У' => 'U', 'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C', 'Ч' => 'Ch',
        'Ш' => 'Sh', 'Щ' => 'Sch', 'Ь' => '', 'Ы' => 'Y', 'Ъ' => '',
        'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya',
    );

    return strtr($value, $converter);
}

global $USER;
$counter = 0;
for ($i = 0; $i < count($countries) - 1; $i++) {
    $el = new CIBlockElement;
    $arFields = [
        "NAME" => $countries[$i],
        "SORT" => $counter,
        "TITLE" => $countries[$i],
        "CODE" => translit($countries[$i]),
        "MODIFIED_BY" => $USER->GetID(), // элемент изменен текущим пользователем
        "IBLOCK_SECTION_ID" => false,          // элемент лежит в корне раздела
        "IBLOCK_ID" => 10,
        "ACTIVE" => "Y",            // активен
        "PROPERTY_VALUES" => $arr,
    ];

    if ($PRODUCT_ID = $el->Add($arFields)) {
        echo "New ID: " . $PRODUCT_ID . "<br>";
        $counter++;
    } else {
        echo "Error: " . $el->LAST_ERROR;
        die();
    }
}
?>